УТ_для_edt/src/Catalogs/смартПравилаДанныхФинансовыхПотоков/смартПравилаДанныхФинансовыхПотоков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартПравилаДанныхФинансовыхПотоков</name>
  <comment>//++ #Б-4832 смарт: Фролов 27.10.2025 //Доработка документа Заявка на расход ДС.</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Отбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартПравилаДанныхФинансовыхПотоков/ManagerModule.bsl
#Область Интерфейс

Функция ПолучитьДанныеПоПравилам(СтруктураДанныхДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартПравилаДанныхФинансовыхПотоков.Отбор КАК Отбор,
	|	смартПравилаДанныхФинансовыхПотоков.БанковскийСчет КАК БанковскийСчет,
	|	смартПравилаДанныхФинансовыхПотоков.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартПравилаДанныхФинансовыхПотоков КАК смартПравилаДанныхФинансовыхПотоков
	|ГДЕ
	|	смартПравилаДанныхФинансовыхПотоков.Использовать
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартПравилаДанныхФинансовыхПотоков.НомерПоПорядку";
		
	СхемаКомпоновкиДанных = Справочники.смартПравилаДанныхФинансовыхПотоков.ПолучитьМакет("УсловияПравилФинансовыхПотоков");
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных));
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	Результат = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НастройкиКомпоновки = Выборка.Отбор.Получить();
		Если НастройкиКомпоновки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		//++ #Б-5408 смарт: Фролов 19.01.2026 //Доработка правил данных финансовых потоков.
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);
		Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Банк");
		Параметр.Использование = ЗначениеЗаполнено(СтруктураДанныхДокумента.Банк);
		Параметр.Значение = СтруктураДанныхДокумента.Банк;
		
		Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("БанковскийСчетКонтрагента");
		Параметр.Использование = ЗначениеЗаполнено(СтруктураДанныхДокумента.БанковскийСчетКонтрагента);
		Параметр.Значение = СтруктураДанныхДокумента.БанковскийСчетКонтрагента;
		
		Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Контрагент");
		Параметр.Использование = ЗначениеЗаполнено(СтруктураДанныхДокумента.Контрагент);
		Параметр.Значение = СтруктураДанныхДокумента.Контрагент;
		
		Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СуммаДокумента");
		Параметр.Использование = ЗначениеЗаполнено(СтруктураДанныхДокумента.СуммаДокумента);
		Параметр.Значение = СтруктураДанныхДокумента.СуммаДокумента;
		
		Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Валюта");
		Параметр.Использование = ЗначениеЗаполнено(СтруктураДанныхДокумента.Валюта);
		Параметр.Значение = СтруктураДанныхДокумента.Валюта;
		
		Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Организация");
		Параметр.Использование = ЗначениеЗаполнено(СтруктураДанныхДокумента.Организация);
		Параметр.Значение = СтруктураДанныхДокумента.Организация; 
		
		Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Автор");
		Параметр.Использование = ЗначениеЗаполнено(СтруктураДанныхДокумента.Автор);
		Параметр.Значение = СтруктураДанныхДокумента.Автор; 

		Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КтоЗаявил");
		Параметр.Использование = ЗначениеЗаполнено(СтруктураДанныхДокумента.КтоЗаявил);
		Параметр.Значение = СтруктураДанныхДокумента.КтоЗаявил; 
		
		Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ХозяйственнаяОперация");
		Параметр.Использование = ЗначениеЗаполнено(СтруктураДанныхДокумента.ХозяйственнаяОперация);
		Параметр.Значение = СтруктураДанныхДокумента.ХозяйственнаяОперация; 
		
		Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ХозяйственнаяОперацияПоЗарплате");
		Параметр.Использование = ЗначениеЗаполнено(СтруктураДанныхДокумента.ХозяйственнаяОперацияПоЗарплате);
		Параметр.Значение = СтруктураДанныхДокумента.ХозяйственнаяОперацияПоЗарплате; 
		//-- #Б-5408 смарт: Фролов 19.01.2026
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,, Истина);
		
		ТаблицаРезультата = Новый ТаблицаЗначений;
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
		Если ТаблицаРезультата.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат Выборка.БанковскийСчет;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоследнийНомерПоПорядку(Родитель) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(НомерПоПорядку), 0) КАК НомерПоПорядку
	|ИЗ
	|	Справочник.смартПравилаДанныхФинансовыхПотоков
	|ГДЕ
	|	Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерПоПорядку;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти
